a52dec
abseil-cpp
acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
aquamarine
archlinux-keyring
at-spi2-core
atkmm
attica
attr
audit
autoconf
automake
avahi
ayatana-ido
baloo
baloo-widgets
base
base-devel
bash
binutils
bison
bluez
bluez-libs
bluez-utils
breeze-icons
brightnessctl
brotli
bubblewrap
byobu
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cfitsio
cifs-utils
cinnamon-desktop
cmake
compiler-rt
convertlit
corepack
coreutils
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
dnsmasq
dolphin
dolphin-plugins
double-conversion
dropbox
dropbox-cli
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
electron39
ell
enchant
exempi
exiv2
expat
faad2
fakeroot
fastfetch
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flex
fmt
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
gawk
gc
gcc
gcc-libs
gcr-4
gdbm
gdbuspp
gdbuspp-debug
gdk-pixbuf2
gedit
gendesk
gettext
giflib
git
glew
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
glycin
gmp
gnulib-l10n
gnupg
gnutls
gobject-introspection-runtime
google-chrome
gperftools
gpgme
gpgmepp
gpm
gpsd
graphene
graphite
grep
grim
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gspell
gssdp
gst-plugins-bad-libs
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtk4-layer-shell
gtkmm-4.0
gtkmm3
guile
gumbo-parser
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
hicolor-icon-theme
hidapi
highway
htop
hunspell
hwdata
hyperfine
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-guiutils
hyprland-qt-support
hyprlang
hyprlauncher
hyprlock
hyprpaper
hyprshot
hyprswitch
hyprswitch-debug
hyprtoolkit
hyprutils
hyprwayland-scanner
hyprwire
iana-etc
icu
imath
imlib2
iniparser
iproute2
iptables
iputils
iso-codes
iso2p
iwd
jansson
jasper
jbig2dec
jbigkit
joplin
joplin-debug
joplin-desktop
jq
json-c
json-glib
jsoncpp
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keepassxc
keyutils
kfilemetadata
kglobalaccel
kguiaddons
ki18n
kiconthemes
kidletime
kio
kio-extras
kirigami
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knewstuff
knotifications
kpackage
kparts
krb5
kservice
ktexteditor
ktextwidgets
kuserfeedback
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
lame
lcms2
ldb
leancrypto
leptonica
less
libappindicator
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcgif
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libde265
libdecor
libdeflate
libdispatch
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libebur128
libedit
libei
libelf
libepoxy
libev
libevdev
libevent
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libgbinder
libgcrypt
libgedit-amtk
libgedit-gfls
libgedit-gtksourceview
libgedit-tepl
libgirepository
libglibutil
libglvnd
libgnomekbd
libgpg-error
libgudev
libhandy
libheif
libice
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libjpeg-turbo
libjxl
libkexiv2
libksba
liblc3
libldac
libldap
libliftoff
libluv
libmakepkg-dropins
libmd
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmtp
libmupdf
libmysofa
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
libopenmpt
libp11-kit
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqalculate
libraw
libraw1394
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvips
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwebsockets
libwireplumber
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyuv
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld
llvm-libs
lm_sensors
lmdb
lsof
lua
lua51-lpeg
luajit
lv2
lxc
lz4
lzo
m4
mailcap
make
mako
man-db
md4c
mdadm
media-player-info
mesa
meson
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
muparser
ncurses
nemo
neovim
nettle
network-manager-applet
networkmanager
nftables
ninja
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
nss-mdns
ocl-icd
oniguruma
openal
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
openvpn
openvpn3
openvpn3-debug
openvpn3-indicator-git
opus
orc
otf-font-awesome
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
pangomm
pangomm-2.48
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pipewire-session-manager
pixman
pkcs11-helper
pkgconf
plasma-activities
playerctl
polkit
polkit-qt6
poppler
poppler-qt6
popt
portaudio
power-profiles-daemon
pps-tools
procps-ng
protobuf
psmisc
pugixml
pulse-native-provider
python
python-attrs
python-autocommand
python-cairo
python-cattrs
python-cffi
python-cryptography
python-dbus
python-docutils
python-gbinder
python-gobject
python-gpgme
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jeepney
python-jinja
python-lsprotocol
python-markupsafe
python-more-itertools
python-packaging
python-platformdirs
python-pycparser
python-pygls
python-pyxdg
python-secretstorage
python-setproctitle
python-setuptools
python-systemd
python-tqdm
python-typing_extensions
python-wheel
qca-qt6
qt5-3d
qt5-base
qt5-declarative
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-shadertools
qt6-speech
qt6-svg
qt6-translations
qt6-wayland
rav1e
re2
readline
rhash
ripgrep
ripgrep-all
rnnoise
rofi
rsync
rtkit
rubberband
ruff
ruff-lsp
rust
sbc
sbcl
sdbus-cpp
sdl2-compat
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
simdjson
sioyek
sioyek-debug
slang
slurp
smbclient
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
spdlog
speedtest-cli
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
stow
sudo
svt-av1
swayimg
sxiv
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tdb
telegram-desktop
tesseract
tesseract-data-afr
tesseract-data-osd
tevent
texinfo
tinysparql
tinyxml2
tmux
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-arimo-nerd
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
twolame
tzdata
udisks2
unibilium
unzip
upower
util-linux
util-linux-libs
uwsm
v4l-utils
vapoursynth
vi
vid.stab
vim
vim-runtime
visual-studio-code-bin
vlc
vlc-cli
vlc-gui-qt
vlc-plugin-a52dec
vlc-plugin-alsa
vlc-plugin-archive
vlc-plugin-dav1d
vlc-plugin-dbus
vlc-plugin-dbus-screensaver
vlc-plugin-faad2
vlc-plugin-flac
vlc-plugin-gnutls
vlc-plugin-inflate
vlc-plugin-journal
vlc-plugin-jpeg
vlc-plugin-lua
vlc-plugin-mpg123
vlc-plugin-ogg
vlc-plugin-opus
vlc-plugin-png
vlc-plugin-pulse
vlc-plugin-shout
vlc-plugin-speex
vlc-plugin-tag
vlc-plugin-theora
vlc-plugin-twolame
vlc-plugin-vorbis
vlc-plugin-vpx
vlc-plugin-xml
vlc-plugins-base
vlc-plugins-video-output
vmaf
volume_key
vulkan-headers
vulkan-icd-loader
waybar
waydroid
wayland
wayland-protocols
webrtc-audio-processing-1
wget
which
wireplumber
wl-clipboard
wlr-randr
wmctrl
wofi
wpa_supplicant
x264
x265
xapp
xapp-symbolic-icons
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-utils
xkeyboard-config
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xkbcomp
xorg-xprop
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yaml-cpp
yazi
yyjson
zeromq
zimg
zip
zix
zlib
zlib-ng
zsh
zstd
